; domain
;; Adapted from: https://github.com/josej30/Planner-Sat-Constraints
;; We use existential preconditions (exists) to remove as many parameters from the actions as possible

(define (domain logistics)

(:requirements :strips :typing :existential-preconditions) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location)
         :precondition  (and 
                             (at ?t ?from)
                             (exists (?c - city)
                                (and (in-city ?from ?c) (in-city ?to ?c))
                              )
                         )
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem problem_37)

(:domain logistics)

(:objects
	obj0 obj2 obj6 - airport
	obj1 obj3 obj7 - city
	obj4 obj5 obj8 obj20 - truck
	obj9 obj10 obj11 obj15 obj17 obj18 obj19 obj21 - package
	obj12 obj13 obj16 - location
	obj14 obj22 - airplane
)

(:init
	(at obj4 obj0)
	(at obj5 obj2)
	(at obj8 obj6)
	(at obj9 obj2)
	(at obj10 obj0)
	(at obj11 obj6)
	(at obj14 obj2)
	(at obj15 obj6)
	(at obj17 obj2)
	(at obj18 obj6)
	(at obj19 obj2)
	(at obj20 obj6)
	(at obj21 obj0)
	(at obj22 obj2)
	(in-city obj0 obj1)
	(in-city obj2 obj3)
	(in-city obj6 obj7)
	(in-city obj12 obj1)
	(in-city obj13 obj1)
	(in-city obj16 obj1)
)

(:goal (and
	(at obj9 obj16)
	(at obj11 obj2)
	(at obj15 obj2)
	(at obj18 obj13)
	(at obj19 obj6)
	(at obj21 obj6)
))
)

; plan
1. (drive obj4 obj0 obj12)
   deleted: (at obj4 obj0)
   added: (at obj4 obj12)
   goals met: 0 of 6
2. (load obj14 obj19 obj2)
   deleted: (at obj19 obj2)
   added: (in obj19 obj14)
   goals met: 0 of 6
3. (load obj22 obj9 obj2)
   deleted: (at obj9 obj2)
   added: (in obj9 obj22)
   goals met: 0 of 6
4. (load obj5 obj17 obj2)
   deleted: (at obj17 obj2)
   added: (in obj17 obj5)
   goals met: 0 of 6
5. (fly obj14 obj2 obj6)
   deleted: (at obj14 obj2)
   added: (at obj14 obj6)
   goals met: 0 of 6
6. (fly obj22 obj2 obj0)
   deleted: (at obj22 obj2)
   added: (at obj22 obj0)
   goals met: 0 of 6
7. (load obj14 obj11 obj6)
   deleted: (at obj11 obj6)
   added: (in obj11 obj14)
   goals met: 0 of 6
8. (load obj14 obj15 obj6)
   deleted: (at obj15 obj6)
   added: (in obj15 obj14)
   goals met: 0 of 6
9. (load obj14 obj18 obj6)
   deleted: (at obj18 obj6)
   added: (in obj18 obj14)
   goals met: 0 of 6
10. (load obj22 obj10 obj0)
   deleted: (at obj10 obj0)
   added: (in obj10 obj22)
   goals met: 0 of 6
11. (load obj22 obj21 obj0)
   deleted: (at obj21 obj0)
   added: (in obj21 obj22)
   goals met: 0 of 6
12. (unload obj22 obj9 obj0)
   deleted: (in obj9 obj22)
   added: (at obj9 obj0)
   goals met: 0 of 6
13. (fly obj14 obj6 obj0)
   deleted: (at obj14 obj6)
   added: (at obj14 obj0)
   goals met: 0 of 6
14. (drive obj4 obj12 obj0)
   deleted: (at obj4 obj12)
   added: (at obj4 obj0)
   goals met: 0 of 6
15. (load obj22 obj9 obj0)
   deleted: (at obj9 obj0)
   added: (in obj9 obj22)
   goals met: 0 of 6
16. (unload obj14 obj11 obj0)
   deleted: (in obj11 obj14)
   added: (at obj11 obj0)
   goals met: 0 of 6
17. (unload obj14 obj15 obj0)
   deleted: (in obj15 obj14)
   added: (at obj15 obj0)
   goals met: 0 of 6
18. (unload obj14 obj18 obj0)
   deleted: (in obj18 obj14)
   added: (at obj18 obj0)
   goals met: 0 of 6
19. (unload obj22 obj10 obj0)
   deleted: (in obj10 obj22)
   added: (at obj10 obj0)
   goals met: 0 of 6
20. (fly obj14 obj0 obj2)
   deleted: (at obj14 obj0)
   added: (at obj14 obj2)
   goals met: 0 of 6
21. (drive obj4 obj0 obj12)
   deleted: (at obj4 obj0)
   added: (at obj4 obj12)
   goals met: 0 of 6
22. (fly obj14 obj2 obj0)
   deleted: (at obj14 obj2)
   added: (at obj14 obj0)
   goals met: 0 of 6
23. (load obj22 obj11 obj0)
   deleted: (at obj11 obj0)
   added: (in obj11 obj22)
   goals met: 0 of 6
24. (load obj22 obj15 obj0)
   deleted: (at obj15 obj0)
   added: (in obj15 obj22)
   goals met: 0 of 6
25. (unload obj22 obj9 obj0)
   deleted: (in obj9 obj22)
   added: (at obj9 obj0)
   goals met: 0 of 6
26. (load obj14 obj18 obj0)
   deleted: (at obj18 obj0)
   added: (in obj18 obj14)
   goals met: 0 of 6
27. (load obj22 obj10 obj0)
   deleted: (at obj10 obj0)
   added: (in obj10 obj22)
   goals met: 0 of 6
28. (load obj22 obj9 obj0)
   deleted: (at obj9 obj0)
   added: (in obj9 obj22)
   goals met: 0 of 6
29. (unload obj14 obj19 obj0)
   deleted: (in obj19 obj14)
   added: (at obj19 obj0)
   goals met: 0 of 6
30. (load obj22 obj19 obj0)
   deleted: (at obj19 obj0)
   added: (in obj19 obj22)
   goals met: 0 of 6
31. (unload obj22 obj11 obj0)
   deleted: (in obj11 obj22)
   added: (at obj11 obj0)
   goals met: 0 of 6
32. (unload obj22 obj15 obj0)
   deleted: (in obj15 obj22)
   added: (at obj15 obj0)
   goals met: 0 of 6
33. (drive obj4 obj12 obj0)
   deleted: (at obj4 obj12)
   added: (at obj4 obj0)
   goals met: 0 of 6
34. (load obj14 obj15 obj0)
   deleted: (at obj15 obj0)
   added: (in obj15 obj14)
   goals met: 0 of 6
35. (load obj22 obj11 obj0)
   deleted: (at obj11 obj0)
   added: (in obj11 obj22)
   goals met: 0 of 6
36. (unload obj14 obj18 obj0)
   deleted: (in obj18 obj14)
   added: (at obj18 obj0)
   goals met: 0 of 6
37. (unload obj22 obj19 obj0)
   deleted: (in obj19 obj22)
   added: (at obj19 obj0)
   goals met: 0 of 6
38. (unload obj22 obj21 obj0)
   deleted: (in obj21 obj22)
   added: (at obj21 obj0)
   goals met: 0 of 6
39. (unload obj22 obj9 obj0)
   deleted: (in obj9 obj22)
   added: (at obj9 obj0)
   goals met: 0 of 6
40. (load obj14 obj19 obj0)
   deleted: (at obj19 obj0)
   added: (in obj19 obj14)
   goals met: 0 of 6
41. (load obj14 obj21 obj0)
   deleted: (at obj21 obj0)
   added: (in obj21 obj14)
   goals met: 0 of 6
42. (load obj4 obj18 obj0)
   deleted: (at obj18 obj0)
   added: (in obj18 obj4)
   goals met: 0 of 6
43. (load obj4 obj9 obj0)
   deleted: (at obj9 obj0)
   added: (in obj9 obj4)
   goals met: 0 of 6
44. (unload obj14 obj15 obj0)
   deleted: (in obj15 obj14)
   added: (at obj15 obj0)
   goals met: 0 of 6
45. (unload obj22 obj10 obj0)
   deleted: (in obj10 obj22)
   added: (at obj10 obj0)
   goals met: 0 of 6
46. (drive obj4 obj0 obj16)
   deleted: (at obj4 obj0)
   added: (at obj4 obj16)
   goals met: 0 of 6
47. (fly obj14 obj0 obj2)
   deleted: (at obj14 obj0)
   added: (at obj14 obj2)
   goals met: 0 of 6
48. (fly obj14 obj2 obj6)
   deleted: (at obj14 obj2)
   added: (at obj14 obj6)
   goals met: 0 of 6
49. (load obj22 obj15 obj0)
   deleted: (at obj15 obj0)
   added: (in obj15 obj22)
   goals met: 0 of 6
50. (unload obj4 obj9 obj16)
   deleted: (in obj9 obj4)
   added: (at obj9 obj16)
   goals met: 1 of 6
51. (drive obj4 obj16 obj13)
   deleted: (at obj4 obj16)
   added: (at obj4 obj13)
   goals met: 1 of 6
52. (fly obj22 obj0 obj2)
   deleted: (at obj22 obj0)
   added: (at obj22 obj2)
   goals met: 1 of 6
53. (unload obj14 obj19 obj6)
   deleted: (in obj19 obj14)
   added: (at obj19 obj6)
   goals met: 2 of 6
54. (unload obj14 obj21 obj6)
   deleted: (in obj21 obj14)
   added: (at obj21 obj6)
   goals met: 3 of 6
55. (unload obj22 obj11 obj2)
   deleted: (in obj11 obj22)
   added: (at obj11 obj2)
   goals met: 4 of 6
56. (unload obj22 obj15 obj2)
   deleted: (in obj15 obj22)
   added: (at obj15 obj2)
   goals met: 5 of 6
57. (unload obj4 obj18 obj13)
   deleted: (in obj18 obj4)
   added: (at obj18 obj13)
   goals met: 6 of 6
